bash/BashInfo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2c0fc57">Bash Scripting with parameters and variables</a>
<ul>
<li><a href="#org06f1fb6">Parameters</a></li>
<li><a href="#orgb1386d5">Variables</a></li>
<li><a href="#org3d94208">User input</a></li>
<li><a href="#orgbc77cd1">Wild cards and patterns</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2c0fc57" class="outline-2">
<h2 id="org2c0fc57">Bash Scripting with parameters and variables</h2>
<div class="outline-text-2" id="text-org2c0fc57">
<p>
Have the shebang at the top
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/bash</span>

</pre>
</div>
</div>

<div id="outline-container-org06f1fb6" class="outline-3">
<h3 id="org06f1fb6">Parameters</h3>
<div class="outline-text-3" id="text-org06f1fb6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Parameter Name</td>
<td class="org-left">How its used</td>
<td class="org-left">Description</td>
</tr>

<tr>
<td class="org-left">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Name or path of the script</td>
</tr>

<tr>
<td class="org-left">1 2 etc</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Positional parameters for functions</td>
</tr>

<tr>
<td class="org-left">/*</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Dont't really know, exapnds all words of positional parameters</td>
</tr>

<tr>
<td class="org-left">@</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Same as above</td>
</tr>

<tr>
<td class="org-left">/#</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Exit code of most recent foreground program</td>
</tr>

<tr>
<td class="org-left">/$</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">The PID of the current shell</td>
</tr>

<tr>
<td class="org-left">/!</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">The PID of the commands most recently run in the background</td>
</tr>

<tr>
<td class="org-left">/_</td>
<td class="org-left">l</td>
<td class="org-left">The last argument of the last command that was executed</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb1386d5" class="outline-3">
<h3 id="orgb1386d5">Variables</h3>
<div class="outline-text-3" id="text-orgb1386d5">
<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold; font-style: italic;">NAME</span>=<span style="font-style: italic;">"BRAD"</span>

<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"My Name is ${NAME}"</span>


</pre>
</div>
</div>
</div>

<div id="outline-container-org3d94208" class="outline-3">
<h3 id="org3d94208">User input</h3>
<div class="outline-text-3" id="text-org3d94208">
<div class="org-src-container">
<pre class="src src-shell">

  <span style="font-weight: bold;">read</span> -p <span style="font-style: italic;">"Enter your name: "</span> USER_NAME
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"$USER_NAME"</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbc77cd1" class="outline-3">
<h3 id="orgbc77cd1">Wild cards and patterns</h3>
<div class="outline-text-3" id="text-orgbc77cd1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Patterns</td>
<td class="org-left">What it does</td>
</tr>

<tr>
<td class="org-left">*</td>
<td class="org-left">Zero or more characters</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-left">Matches any one charecters</td>
</tr>

<tr>
<td class="org-left">[&#x2026;]</td>
<td class="org-left">Match any character in the set</td>
</tr>

<tr>
<td class="org-left">[^..]</td>
<td class="org-left">Any chars not in the brackets</td>
</tr>

<tr>
<td class="org-left">[a-f]</td>
<td class="org-left">Any charecters in the range</td>
</tr>

<tr>
<td class="org-left">\</td>
<td class="org-left">Escape character  Eg. *\?  (Matches strings ending in a ?)</td>
</tr>
</tbody>
</table>



<p>
Here's an example of a script that will list all jpg in current directory
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">for</span> file<span style="font-weight: bold;"> in</span> *.JPG *.jpeg; <span style="font-weight: bold;">do </span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"$file"</span>
<span style="font-weight: bold;">done</span>

</pre>
</div>

<p>
Below its modified to replace the extension to png
</p>


<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">for</span> file<span style="font-weight: bold;"> in</span> *.JPG *.jpeg; <span style="font-weight: bold;">do</span> mv -- <span style="font-style: italic;">"$file"</span> <span style="font-style: italic;">"${file%.*}.png"</span>
<span style="font-weight: bold;">done</span>


</pre>
</div>



<p>
This is done using parameter editing
</p>


<p>
Here I just echo the string were going to use
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgc0f64e2">
  <span style="font-weight: bold; font-style: italic;">VAR</span>=<span style="font-style: italic;">"Hello.my.name.is.malcolm.what.is.your.name"</span>
<span style="font-weight: bold;">echo</span> $<span style="font-weight: bold; font-style: italic;">VAR</span>

</pre>
</div>

<p>
This patter removes the shortest pattern from the start of the string.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR#*.}"</span>
</pre>
</div>

<p>
This starts from the begging and deletes the longest instance of the pattern
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR##*.}"</span>

</pre>
</div>

<p>
This deletes the first instance from the back of the string because its the smallest from the end of the string
</p>


<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR%.*}"</span> 

</pre>
</div>

<p>
The longest instance from the back of the string
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR%%.*}"</span>

</pre>
</div>

<p>
This uses the format ${parameter/patter/string}  where the first instance of the patter is replaced with the string. Null when string is empty. 
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR/malcolm/brad}"</span>

</pre>
</div>

<p>
Same as above but every instance of name is replaced ${paramete//pattern/stringr}
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR//name/adress}"</span>

</pre>
</div>

<p>
Adds a prefix to the beginning of the string
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR/#/prefix}"</span>

</pre>
</div>

<p>
Adds a prefix to the end of the string
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR/%/prefix}"</span>

</pre>
</div>


<p>
If the parameter is null or not yet set you can us a default value like so
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR:=its null}"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR1:=its null}"</span>


</pre>
</div>

<p>
If its null assign the default value to the parameter
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR:=hello}"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR1:=hello}"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"$VAR1"</span>

</pre>
</div>


<p>
If the parameter is null or not yet set do nothing.  Otherwise subsitute the value to the passed string
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR:+newValue}"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR1:+itsnull}"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"$VAR"</span>

</pre>
</div>


<p>
The values length in charecters
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${#VAR}"</span>



</pre>
</div>



<p>
This function can access a part of a string.  ${parameter:offset:length}  if no length than go to the end.  if offset is negative(with parens) go backwards  
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR::14}"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR:14:3}"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR:17:8}"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${VAR:(-17)}"</span>

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
